In [19]:
import pandas as pd
%matplotlib inline

In [2]:
income = pd.read_csv('data/income_per_person_gdppercapita_ppp_inflation_adjusted.csv')

men_mean_yrs_school = pd.read_csv('data/mean_years_in_school_men_25_years_and_older.csv')
women_mean_yrs_school = pd.read_csv('data/mean_years_in_school_women_25_to_34_years.csv')

agriculture = pd.read_csv('data/agriculture_workers_percent_of_employment.csv')
industry = pd.read_csv('data/industry_workers_percent_of_employment.csv')
service = pd.read_csv('data/service_workers_percent_of_employment.csv')

family = pd.read_csv('data/family_workers_percent_of_employment.csv')
self_employed = pd.read_csv('data/self_employed_percent_of_employment.csv')
salaried = pd.read_csv('data/salaried_workers_percent_of_non_agricultural_employment.csv')

In [3]:
income.head(2)

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2031,2032,2033,2034,2035,2036,2037,2038,2039,2040
0,Afghanistan,603,603,603,603,603,603,603,603,603,...,2420,2470,2520,2580,2640,2700,2760,2820,2880,2940
1,Albania,667,667,667,667,667,668,668,668,668,...,18500,18900,19300,19700,20200,20600,21100,21500,22000,22500

In [4]:
income = income.melt(id_vars=['country'], var_name='year', value_name='income')

In [5]:
income.head(2)

       country  year  income
0  Afghanistan  1800     603
1      Albania  1800     667

In [6]:
men_mean_yrs_school.head(2)

,country,1970,1971,1972,1973,1974,1975,1976,1977,1978,...,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009
0,Afghanistan,0.7,0.7,0.8,0.8,0.8,0.9,0.9,0.9,1.0,...,2.1,2.1,2.2,2.3,2.3,2.4,2.4,2.5,2.6,2.6
1,Albania,5.1,5.2,5.3,5.5,5.6,5.7,5.9,6.0,6.1,...,9.1,9.2,9.4,9.5,9.6,9.8,9.9,10.0,10.1,10.2

In [7]:
men_mean_yrs_school = men_mean_yrs_school.melt(id_vars=['country'], var_name='year', value_name='mean_years')

In [8]:
men_mean_yrs_school.head(2)

       country  year  mean_years
0  Afghanistan  1970         0.7
1      Albania  1970         5.1

In [9]:
women_mean_yrs_school.head(2)

,country,1970,1971,1972,1973,1974,1975,1976,1977,1978,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,Afghanistan,0.21,0.22,0.22,0.23,0.24,0.25,0.26,0.27,0.27,...,0.72,0.75,0.78,0.8,0.83,0.86,0.89,0.92,0.95,0.98
1,Albania,5.33,5.47,5.60,5.74,5.87,6.01,6.16,6.30,6.44,...,10.80,11.00,11.10,11.3,11.50,11.60,11.80,11.90,12.10,12.30

In [10]:
women_mean_yrs_school = women_mean_yrs_school.melt(id_vars=['country'], var_name='year', value_name='mean_years')

In [11]:
women_mean_yrs_school.head(2)

       country  year  mean_years
0  Afghanistan  1970        0.21
1      Albania  1970        5.33

In [12]:
agriculture = agriculture.melt(id_vars=['country'], var_name='year', value_name='agriculture_workers_perc')
industry = industry.melt(id_vars=['country'], var_name='year', value_name='industry_workers_perc')
service = service.melt(id_vars=['country'], var_name='year', value_name='service_workers_perc')

In [13]:
agriculture.head(2)

       country  year  agriculture_workers_perc
0  Afghanistan  1970                       NaN
1      Albania  1970                       NaN

In [14]:
family = family.melt(id_vars=['country'], var_name='year', value_name='family_workers_perc')
salaried = salaried.melt(id_vars=['country'], var_name='year', value_name='salaried_workers_perc')
self_employed = self_employed.melt(id_vars=['country'], var_name='year', value_name='self_employed_workers_perc')

In [15]:
family.head(2)

       country  year  family_workers_perc
0  Afghanistan  1970                  NaN
1      Albania  1970                  NaN

In [34]:
income.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46513 entries, 0 to 46512
Data columns (total 3 columns):
country    46513 non-null object
year       46513 non-null object
income     46513 non-null int64
dtypes: int64(1), object(2)
memory usage: 1.1+ MB

In [42]:
sum(income.duplicated())

0

In [35]:
men_mean_yrs_school.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6960 entries, 0 to 6959
Data columns (total 3 columns):
country       6960 non-null object
year          6960 non-null object
mean_years    6960 non-null float64
dtypes: float64(1), object(2)
memory usage: 163.2+ KB

In [43]:
sum(men_mean_yrs_school.duplicated())

0

In [33]:
women_mean_yrs_school.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8602 entries, 0 to 8601
Data columns (total 3 columns):
country       8602 non-null object
year          8602 non-null object
mean_years    8602 non-null float64
dtypes: float64(1), object(2)
memory usage: 201.7+ KB

In [44]:
sum(women_mean_yrs_school.duplicated())

0

In [37]:
agriculture.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8448 entries, 0 to 8447
Data columns (total 3 columns):
country                     8448 non-null object
year                        8448 non-null object
agriculture_workers_perc    3470 non-null float64
dtypes: float64(1), object(2)
memory usage: 198.1+ KB

In [45]:
sum(agriculture.duplicated())

0

In [36]:
industry.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8448 entries, 0 to 8447
Data columns (total 3 columns):
country                  8448 non-null object
year                     8448 non-null object
industry_workers_perc    3534 non-null float64
dtypes: float64(1), object(2)
memory usage: 198.1+ KB

In [46]:
sum(industry.duplicated())

0

In [38]:
service.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8448 entries, 0 to 8447
Data columns (total 3 columns):
country                 8448 non-null object
year                    8448 non-null object
service_workers_perc    3534 non-null float64
dtypes: float64(1), object(2)
memory usage: 198.1+ KB

In [47]:
sum(service.duplicated())

0

In [39]:
family.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8208 entries, 0 to 8207
Data columns (total 3 columns):
country                8208 non-null object
year                   8208 non-null object
family_workers_perc    2473 non-null float64
dtypes: float64(1), object(2)
memory usage: 192.5+ KB

In [48]:
sum(family.duplicated())

0

In [40]:
salaried.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9940 entries, 0 to 9939
Data columns (total 3 columns):
country                  9940 non-null object
year                     9940 non-null object
salaried_workers_perc    1760 non-null float64
dtypes: float64(1), object(2)
memory usage: 233.0+ KB

In [49]:
sum(salaried.duplicated())

0

In [41]:
self_employed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5728 entries, 0 to 5727
Data columns (total 3 columns):
country                       5728 non-null object
year                          5728 non-null object
self_employed_workers_perc    5728 non-null float64
dtypes: float64(1), object(2)
memory usage: 134.3+ KB

In [50]:
sum(self_employed.duplicated())

0